var fs = require("fs");

var wordcut = require("wordcut");
var difftext = require("diff-text");

var word2 = `พ่อ เจ้า พระ ขันติ ยะลา มัง กุ เข้ามา ในห้อง มัน ทม ด้วย สีหน้า คุณ คิด หวน นึกถึง การ สนทนา กับ แม่ เจ้า ปทุม รัตน์ ห้า ก่อนหน้านี้
ตอนนั้น พ่อ เจ้า ตกใจ มาก มองหน้า แม่เจ้า หลัง อีก ฝ่าย เล่า เรื่อง สู่ ขอ สะอาด ให้ จบลง
สำหรับ ความจริง เสีย เถิด ค่ะ ท่าน โลก ของ อิชั้น รักษา ไม่หาย หรอก ยังไง วันหนึ่ง อิฉัน ก็ ต้อง จาก กัน ไป แต่ อิฉัน จะไม่ ยอม เป็น เมีย ใจ ดัง ทิ้ง ให้ ท่าน ต้อง อยู่ โดดเดี่ยวกลาง
โอ๊ย แน่ บัว ฉัน อาจ จะไป ก่อนหน้า บัว ก็ได้ ใคร จะรู้ เรื่อง นั้น มัน ยัง อีกไกล อย่า ของ พ่อ แพทย์ สุดท้าย ก็ ได้ผล ดี อยู่ ดูสิ แค่ ไม่กี่ วัน แม่ บัว ก็
นาย จะตาย มีใจ ความว่า ดาบ มา ทำตาม สัญญา ที่เคย ให้ กัน
ล่าโจร มี เสื้อ และ กอล์ฟ สงสัย มาก นั่น คือ อะไร พวกเขา จึง ตัดสินใจ เดินทาง กลับ ไปที่ บ้าน เกิด ของ เอ็กซ์ เพื่อหา คำตอบ
ทายาท ไปทำงาน ตี สี่ เน สุดา โจร ขโมย พาสเวิร์ด ของ คอม เพื่อ เอาไป ศึกษา หา ความ ผิดปกติ ของ แมนเชสเตอร์ ที่บ้าน
นอกจาก รัก คุณ แล้ว ผม ก็ ไม่ เก่ง อะไร เลย
ฉัน ตาย โดย ปราศจาก คนที่ รักฉัน แต่ ฉันก็ อิ่มใจ ว่า ฉันมี คนที่ ฉันรัก
สิ่งสำคัญ ของการ เดินทาง ไม่ใช่ จุดหมาย แต่ อยู่ที่ ระหว่าง ทาง ต่างหาก`.replace(/ */g,'')

var word1 = `พ่อเจ้าพระขัตติยะรามังกูร เข้ามาในห้องบรรทมด้วยสีหน้าครุ่นคิด หวนนึกถึงการสนทนากับแม่เจ้าปทุมรัตน์ก่อนหน้านี้
ตอนนั้นพ่อเจ้าตกใจมาก มองหน้าแม่เจ้า หลังอีกฝ่ายเล่าเรื่องสู่ขอสะอาดให้จบลง
ยอมรับความจริงเสียเถิดค่ะท่าน โรคของอิฉันรักษาไม่หายหรอก ยังไงวันหนึ่ง อิฉันก็ต้องจากท่านไป แต่อิฉันจะไม่ยอมเป็นเมียใจดำ ทิ้งให้ท่านต้องอยู่โดดเดี่ยวเพียง
โธ่เอ๋ย แม่บัว ฉันอาจจะไปก่อนแม่บัวก็ได้ ใครจะรู้ เรื่องนั้นมันยังอีกไกล ยาของพ่อแพทย์พุทไธก็ได้ผลดี ดูสิ แค่ไม่กี่วัน แม่บัวก็
ในจดหมายมีใจความว่า กลับมาทำตามสัญญาที่เคยให้กัน
ต้า, โจ, บี, เสือ และ กอล์ฟ สงสัยว่ามันคืออะไร พวกเขาจึงตัดสินใจเดินทางกลับไปที่บ้านเกิดของ เอ็กซ์ เ เพื่อหาคำตอบ
ดาญ่าไปทำงานตีซี้เนตรสุดาจนขโมยพาสเวิดเข้าคอมเพื่อเอาไปศึกษาหาความผิดปกติของบัญชีต่อที่บ้าน
นอกจากรักคุณแล้วผมก็ไม่เก่งอะไรเลย
ฉันตายโดยปราศจากคนที่รักฉัน แต่ฉันก็อิ่มใจว่า ฉันมีคนที่ฉันรัก
สิ่งสำคัญของการเดินทางไม่ใช่จุดหมาย แต่อยู่ที่ระหว่างทางต่างหาก`.replace(/ */g,'')



wordcut.init();

word1 = wordcut.cut(word1,' ')
word2 = wordcut.cut(word2,' ')

// console.log(word1);
// console.log(word2);

fs.writeFile("./outputs/word1.txt", word1, (err) => {
    if (err) {
        console.error(err);
        return;
    };
    console.log("File has been created");
});

fs.writeFile("./outputs/word2.txt", word2, (err) => {
    if (err) {
        console.error(err);
        return;
    };
    console.log("File has been created");
});

difftext_result = difftext(word1,word2)

// console.log(difftext_result)

let word_count = 0
let wrong_word_count = 0

let nearby=5
check_diff = (line1,line2)=>{
  let split1 = line1.split(' ')
  let split2 = line2.split(' ')
  
  split1.forEach((w,i)=>{
    word_count +=1;
    let min = Math.max(0,i-nearby)
    let max = Math.min(split2.length-1,i+nearby)
    
    let sliceArr = split2.slice(min,max+1)
    if (sliceArr.indexOf(w) === -1 ){
      wrong_word_count += 1;
    }
  })
}



let word1_split = word1.split("\n")
let word2_split = word2.split("\n")
word1_split.forEach((line,idx)=>{
  check_diff(line,word2_split[idx])
})

let accuracy = 100 - wrong_word_count/word_count*100
console.log(accuracy)

