var fs = require("fs");

var wordcut = require("wordcut");
var difftext = require("diff-text");

var word2 = `นักวิชาการ ด้าน ศาสตร์ วิทยา ออก มาให้ ข้อมูล หลัง กังวล กรง ศิลปะ ร์ สะ แก้ไข ข้อมูล เรื่อง งบประมาณ อย่างเป็น ทางการ
ก็ ชาว ท่า ฉ ผ่าน หลักเกณฑ์ การ เรียกคืน คลื่น คลื่น ความถี่ ที่ไม่ ได้ใช้ ประโยชน์ และใช้ ประโยชน์ ไม่ คุ้มค่า พร้อม เยียวยา เพื่อนำ กลับมา ประมูล ใหม่ และ ส่ง ไป ประกาศ ใน ราชกิจ จานุ
เมื่อวัน ที่ จะ สอง พฤศจิกายน ที่สาม สน โคกคราม กว้าง กมล ชนก เข มะ โยธิน อายุ ห้าสิบ เอ็ด ปี ดารา นักแสดง ชื่อดัง เดินทางเข้า
ปาน เทพ นำ คณะ เครือข่าย กัญชา เพื่อ การ เเพทย์ ยื่น หนังสือ ปธ สนช แก้ ร่าง พ ร บ ยาเสพติด พร้อม แนะ สี่ ขอไม่ ให้ ผูกขาด ใช้ประโยชน์ ยกเลิก จด จิตติ บัตร
ที่ ยี่สิบ เอ็ด ก ซิ ก้า ยนต์ สำนักข่าว ท้องถิ่น ในประเทศ มาเลเซีย ได้ รายงาน การ เสียชีวิต ของ อดีต แกนนำ สมาชิก ขบวนการ ปลดปล่อย ปัตตานี ใน นาม พูโล เมื่อ วัน ที่
การกู้ ปรีชา กล่าวว่า รู้สึก สบายใจ ตั้งแต่ คดี เริ่มแรก แล้วที่ ได้นำ ความจริง มาสู่ ขึ้นสู่ ศาล และ ต้อง ขอขอบคุณ สื่อมวลชน ที่ ช่วย ติดตาม ข่าว นี้ และขอ ให้ ครับ
ผู้สื่อข่าว รายงานว่า ได้มี ฝูง บิน เข้า หน่อย ราว สี่ ตัว ที่ ยก ฝูง ลงมา หากิน บริเวณ ษ ษ บัว แหลม สมิหลา เขต เทศ บาล น คร
นิกเก รณฤทธิ์ ซื่อ หวาน จ้า ผู้อำนวยการ สโมสร เคนห์ ผยอง เอสซีจี เมืองทอง ยูไนเต็ด ออกมา เผยว่า ใน ฤดูกาล หน้า ทีม
เห็น ชาติ กัมพูชา เก็บ สาม คะแนน แรก ใน ซูซูกิ คัพ ได้ สำเร็จ หลัง เปิดบ้าน เอาชนะ ราว สาม ต่อ หนึ่ง และยัง แต่ กระเด็น ตกรอบ พร้อม ล่าว หลัง เหลือ การแข่งขัน เพียง นัด เดียว
คิม ไค อัน นักกอล์ฟ ไปด้วย โป๋ อ่าว กิ เดช อภิบาล รัตน์ และ โลมา ยักษ์ ผมมี สวัสดิ์ เปิดตัว ใน ศึก ไอเอส มี เอส `.replace(/ */g,'')

var word1 = `นักวิชาการด้านศาสนวิทยา ออกมาให้ข้อมูลหลัง กรมศิลปากรได้แก้ไขข้อมูลเรื่อง “นางนพมาศ” อย่างเป็นทางการ
กสทช. ผ่านหลักเกณฑ์การเรียกคืนคลื่นความถี่ที่ไม่ได้ใช้ประโยชน์ หรือใช้ประโยชน์ไม่คุ้มค่า พร้อมเยียวยา เพื่อนำกลับมาประมูลใหม่ และส่งไปประกาศในราชกิจจานุ
เมื่อวันที่ 22 พ.ย. ที่สน.โคกคราม กวาง กมลชนก เขมะโยธิน อายุ 51 ปี ดารานักแสดงชื่อดัง เดินทางเข้า
“ปานเทพ” นำคณะเครือข่ายกัญชาเพื่อการแพทย์ ยื่นหนังสือ ปธ.สนช.แก้ร่าง พ.ร.บ.ยาเสพติด พร้อมแนะ 4 ข้อ ไม่ให้ผูกขาดใช้ประโยชน์ ยกเลิกจดสิทธิบัตร
วันนี้ (21 พ.ย.) สำนักข่าวท้องถิ่นในประเทศมาเลเซีย ได้รายงานการเสียชีวิตของอดีตแกนนำสมาชิกขบวนการปลดปล่อยปัตตานี ในนามพูโล เมื่อวันที่ 
ด้าน ครูปรีชา กล่าวว่า รู้สึกสบายใจตั้งแต่คดีเริ่มแรกแล้วที่ได้นำความจริงมาขึ้นสู่ศาล และต้องขอขอบคุณสื่อมวลชนที่คอยติดตามข่าวนี้และขอให้คอย
ผู้สื่อข่าวรายงานว่า ได้มีฝูงลิงเขาน้อยราว 40 ตัว ที่ยกฝูงลงมาหากินบริเวณสระบัวแหลมสมิหลา เขตเทศบาลนคร
"บิ๊กเป้" รณฤทธิ์ ซื่อวาจา ผู้อำนวยการสโมสร "กิเลนผยอง" เอสซีจี เมืองทอง ยูไนเต็ด ออกมาเผยว่า ในฤดูกาลหน้า ธีร
แม้ทีมชาติกัมพูชาเก็บ 3 คะแนแรกใน ซูซูกิ คัพ ได้สำเร็จหลังเปิดบ้านเอาชนะลาว 3-1 แต่ยังกระเด็นตกรอบพร้อมลาว หลังเหลือการแข่งขันเพียงนัดเดียว
ทีมไทย อันประกอบไปด้วย "โปรอาร์ม" กิรเดช อภิบาลรัตน์ และ "โลมายักษ์" พรหม มีสวัสดิ์ เปิดตัวในศึกไอเอสพีเอส `.replace(/ */g,'')



wordcut.init();

word1 = wordcut.cut(word1,' ')
word2 = wordcut.cut(word2,' ')

// console.log(word1);
// console.log(word2);

fs.writeFile("./outputs/word1.txt", word1, (err) => {
    if (err) {
        console.error(err);
        return;
    };
    console.log("File has been created");
});

fs.writeFile("./outputs/word2.txt", word2, (err) => {
    if (err) {
        console.error(err);
        return;
    };
    console.log("File has been created");
});

difftext_result = difftext(word1,word2)

// console.log(difftext_result)

let word_count = 0
let wrong_word_count = 0

let nearby=5
check_diff = (line1,line2)=>{
  let split1 = line1.split(' ')
  let split2 = line2.split(' ')
  
  split1.forEach((w,i)=>{
    word_count +=1;
    let min = Math.max(0,i-nearby)
    let max = Math.min(split2.length-1,i+nearby)
    
    let sliceArr = split2.slice(min,max+1)
    if (sliceArr.indexOf(w) === -1 ){
      wrong_word_count += 1;
    }
  })
}



let word1_split = word1.split("\n")
let word2_split = word2.split("\n")
word1_split.forEach((line,idx)=>{
  check_diff(line,word2_split[idx])
})

let accuracy = 100 - wrong_word_count/word_count*100
console.log(accuracy)

